[{
    "name":"Coach Randy McAllister",
    "url":"https://images.squarespace-cdn.com/content/v1/611fe8cc7338f973c3f48046/f779dba0-9a23-43a7-a76e-f5c536c8347e/CoachMcAllister.png?format=2500w",
    "info":["Coach McAllister is in his 20th season of coaching the Viking's Basketball program. Over the last 7 years, PG Hoops has won more games than any 6A team in the state, amassing a record of 171-47. With a total of 357 wins in his varsity head coaching career (294 of those at PG)... Coach McAllister gives a lot of credit to his assistant coaches and all the hard work and dedication they have shown. Together, the coaching staff is fully committed to help lead PG Hoops to a Championship! ",
            "Coach McAllister came to Pleasant Grove from Southern California where he grew up and spent 15 years teaching and coaching. Coach McAllister's basketball roots began in Orange County, CA, where he played his high school ball at Huntington Beach High School. From there he traveled to Northern California where he played for 2 years at Shasta College in Redding. His experience included starting as a freshman on a team that won the California State Championship, as well as being named All-Conference, team MVP and team Captain as a sophomore. Coach returned to Southern California to play his junior and senior years at Vanguard University (formerly Southern California College). an NAIA college in Costa Mesa, CA. At VU his honors included being selected 1st team All-GSAC as a junior and senior in addition to team MVP and team Captain as a senior. One of the most important things Coach McAllister says he received from his time spent at Vanguard, was the knowledge he gained from Coach Bill Reynolds about the game of basketball and how it can be directly related to life and becoming successful.",
            "Coach McAllister likes to compare playing \"TEAM\" basketball to being part of a \"FAMILY\". He says, \"A family functions best when all parties involved carry out their responsibilities, communicate, and show other members they care about them. If our coaches and players apply these fundamental principles to their basketball family. we'll be successful.\" Coach McAllister resides in Lehi with his beautiful wife of 33 years, Julie. He has three awesome children, Kelsye (31), Cory (29) and Molly (26), as well as 5 grand babies; Finnegan (5), Callahan (3), Hazel (2), Sulli (8 months) and Royce (5 months)."
        ]
    },{
    "name":"Alan Groves",
    "url": "https://images.squarespace-cdn.com/content/v1/611fe8cc7338f973c3f48046/34f2124f-2fba-4de1-9613-b1e34d21aa47/CoachGroves.png?format=1000w",
    "info":["Alan Groves is a PGHS alumnus and former PG player. This is his 20th year coaching high school basketball and his sixth coaching with the boys program. He was a member of the coaching staff from 2006-2011 and then he left to become the head varsity coach at Mountain View high school. Coach Groves started his coaching career as a member of the girls coaching staff at PGHS. Somehow he convinced Amanda Goodrich Groves to marry him (she is way out of his league), and they have four vivacious children: Seka, Tava, Nima, and Tu."
            ],
    "number":3
}
]